/*
 * (C) Copyright 2017 North Atlantic Industries, Inc.
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */
 
#include <common.h>
#include <asm/io.h>
#include <malloc.h>
#include <i2c.h>
#include "fpga_address.h"
#include "module_init.h"
#include "builtin_module_init.h"
//#include <nai_icb.h>
//#include <nai_pci.h>
//#include <master_slave.h>
//#include <NAISerdes.h>
//#include <cmd_naiopermsgutils.h>

#undef DEBUG
//#define DEBUG
#ifdef DEBUG
#define DEBUGF(x...) printf(x)
#else
#define DEBUGF(x...)
#endif /* DEBUG */

#define NAI_SUCCESS        0
#define NAI_FAILED        -1
#define EEPROM_50_ADDR     0x50
#define EEPROM_51_ADDR     0x51
#define EEPROM_SIZE        256

/*special module defined */
#define MODULE_ID_CTS      0x43545300UL 
#define MODULE_ID_DT4      0x44543400UL
#define MODULE_ID_ES1      0x45533100UL
#define MODULE_ID_ES2      0x45533200UL
#define MODULE_ID_EM1      0x454D3100UL
#define MODULE_ID_FM5      0x464D3500UL
#define MODULE_ID_FW1      0x46573100UL
#define MODULE_ID_FW2      0x46573200UL
#define MODULE_ID_TE1      0x54453100UL
#define MODULE_ID_NON      0x4E4F4E00UL
#define MODULE_ID_SPACE    0x00000020UL

#define MODULE_ADDR_RDY    0xA5A5A5A5UL

#define MODULE_DONE_TIMEOUT        (10 * 1000)     //3 * 1000ms = 3 seconds
#define MODULE_100000_USDELAY      (100 * 1000)    //100ms 
#define MODULE_25000_USDELAY       (25 * 1000)     //25ms
/*AXI I2C Port defined*/
#if defined(NAI_MODULE1_EEPROM_BUS_NUM) || defined(NAI_MODULE2_EEPROM_BUS_NUM) \
|| defined(NAI_MODULE3_EEPROM_BUS_NUM) || defined(NAI_MODULE4_EEPROM_BUS_NUM) \
|| defined(NAI_MODULE5_EEPROM_BUS_NUM) || defined(NAI_MODULE6_EEPROM_BUS_NUM)
static unsigned int const i2c_bus_num[] = {
    (unsigned int)NAI_MODULE1_EEPROM_BUS_NUM,
#if (MAX_MODULE_SLOT > 1)
    (unsigned int)NAI_MODULE2_EEPROM_BUS_NUM,
#endif    
#if (MAX_MODULE_SLOT > 2)
    (unsigned int)NAI_MODULE3_EEPROM_BUS_NUM,
#endif        
#if (MAX_MODULE_SLOT > 3)    
    (unsigned int)NAI_MODULE4_EEPROM_BUS_NUM,
#endif        
#if (MAX_MODULE_SLOT > 4)    
    (unsigned int)NAI_MODULE5_EEPROM_BUS_NUM,
#endif        
#if (MAX_MODULE_SLOT > 5)    
    (unsigned int)NAI_MODULE6_EEPROM_BUS_NUM,
#endif        
};
#endif

#define HSS_MOD_COMMON_MEM_ADDRESS      0x0UL
#define HSS_MOD_VER_ADDR               (HSS_MOD_COMMON_MEM_ADDRESS + 0x0030)

//Module common module mode ready state offset
#define HSS_MOD_READY_STATE      (HSS_MOD_COMMON_MEM_ADDRESS + 0x025CUL)
//Module Operation Mode States
#define HSS_MOD_OPERSTATE_FW_ENTERED_BIT                 (1UL << 16)
#define HSS_MOD_FW_READY_TIMEOUT                         (5 * 1000) // 5 * 1000ms = 5 seconds
#define HSS_MOD_RECOVERY_COUNT    5

#ifdef CONFIG_NAI_DEFAULT_MODULE_LO_SIZE_LIMIT
#define MODULE_LO_SIZE CONFIG_NAI_DEFAULT_MODULE_LO_SIZE_LIMIT
#else
#define MODULE_LO_SIZE 0x4000 //16KB
#endif

#ifdef CONFIG_NAI_DEFAULT_MODULE_HI_SIZE_LIMIT
#define MODULE_HI_SIZE CONFIG_NAI_DEFAULT_MODULE_HI_SIZE_LIMIT
#else
#define MODULE_HI_SIZE 0x200000 //2MB
#endif

#ifdef CONFIG_NAI_MAX_MODULE_MASK_SIZE_LIMIT
#define MODULE_MAX_SIZE CONFIG_NAI_MAX_MODULE_MASK_SIZE_LIMIT
#else
#define MODULE_MAX_SIZE 0x800000 //8MB
#endif

/*MB Reset Register Map 0x43C1 0008*/
/*MB Reset Register Map ultrascale 0x83C1 0008*/
typedef volatile struct {
    
    union {                               /*0x008 Reset duration*/
        u32 reg;
        struct {
                u32 reset_dur       : 8;  /*bit 0 - 7 reset duration*/
                u32 _reservered1    :24;  /*bit 8 - 31 reserved*/
        } bits;
    } reset_timer;
    
    union {                               /*0x00C Reset Control Reg*/
        u32 reg;
        struct {
            u32 _reservered1    : 5;  /*bit 0 - 4 reserved*/
            u32 pcie            : 1;  /*bit 5 PCIe reset*/
            u32 _reservered2    :26;  /*bit 6 - 31 reserved*/
        } bits;
    } reset_ctr;
        
    u32 all_mod_mask;  /*0x068 all module address decode mask*/
     
} MB_RESET_CONFIG_REG;

/*MB FPGA Module Address Config Status Register Map 0x83C0 0018*/
typedef volatile struct {
    union {
        u32 reg;
        struct {
                u32 _reservered1   :20;  /*bit 0 - 19  reservered*/
                u32 config_done    : 1;  /*bit 20 FPGA module address config done*/
                u32 _reservered2   :11;  /*bit 21 - 31 reservered*/
        } bits;
    } status;
} MOD_ADDR_CONFIG_STATUS;

/*Module ID Status Register Map 0x43C0 0028 - 0x43C0 0060*/
typedef volatile struct {
    u32 mod_addr_offset;                  /*0x028 HSS module memory start offset*/
    union {                               /*0x02C module status from FPGA*/
        u32 reg;
        struct {
                u32 detected       : 8;  /*bit 0 - 7  module detected by FPGA bit (ReadOnly)*/
                u32 _reservered1   : 8;  /*bit 8 - 15 reservered*/
                u32 powered        : 8;  /*bit 16 - 23 module powered on by FPGA (ReadOnly)*/
                u32 _reservered2   : 8;  /*bit 24 - 31 reservered*/
        } bits;
    } status;
    struct {                             /*0x030 - 0x05C module id and module size that FPGA read from module eeprom*/
        u32 id;
        u32 size;
    } mod[6];
} MOD_INFO_REG;

/*MB Built-in ID register 0x84c10300*/
typedef volatile struct {
    
    u32 mod_id;        /*0x000 built-in module id*/
    u32 mod_size;      /*0x004 built-in module size*/

} MB_BUILTIN_MOD_ID_REG;

/*Module address Configuration Register Map 0x43C1 0030*/
/*Module address Configuration Register Map ultrascale 0x83C1 0030*/
typedef volatile struct {
                      /*0x000 - 0x064 module 1 - 7 address and enable*/
    struct {
        union {
            u32 reg;
            struct {
                u32 _reserverd1   : 2;  /*bit 0 - 1 reserved*/
                u32 end_adr       :10;  /*bit 2 - 11 end of module address*/
                u32 _reservered2  : 6;  /*bit 12 - 17 start of module address*/
                u32 start_adr     :10;  /*bit 18 - 27 start of module address*/
                u32 _reservered3  : 4;  /*bit 28 - 31 reserverd*/
            } bits;
        } adr;
        union {
            u32 reg;
            struct {
                u32 enabled       : 1;  /*bit 0 HSS access enable bit*/
                u32 _reserverd1   :31;  /*bit 1 - 31 reserved*/
            } bits;
        } status;
    } mod_adr_cfg[7];
    
    u32 all_mod_mask;  /*0x068 all module address decode mask*/
     
} MOD_ADDR_CONFIG;

/*Module HSS Configuration Register Map 0x43C4 4100*/
/*Module HSS Configuration Register Map ultrascale 0x83C4 4100*/
typedef volatile struct {
    union {
        u32 reg;                     /*0x000 - module hss detected status */
        struct {
            u32 detected        : 8; /*bit 0 - 7 hss detected bitmap per module slot*/
            u32 detection_done  : 8; /*bit 8 - 15 hss detection Done bitmap per module slot*/
            u32 _reserved       :16; /*bit 16 - 31 reserved*/
        } bits;
    } det_status;
    
    union {
        u32 reg;                    /*0x004 - module hss  link status */
        struct {
            u32 linked        : 8; /*bit 0 - 7 hss linked bitmap per module slot*/
            u32 link_done     : 8; /*bit 8 - 15 hss link done bitmap per module slot*/
            u32 _reserved     :16; /*bit 16 - 31 reserved*/
        } bits;
    } link_status;
    
    u32 resetn;                    /*0x008 - module hss reset bitmap bit 0 ~ 7*/
    u32 pwr_supply_en;             /*0x00C - module hss power supply enable bitmap bit 0 ~ 7*/
    u32 link_fail_stat;            /*0x010 - module link failed status bitmap bit 0 ~ 7*/
    u32 clk_en;                    /*0x014 - module clock enable bitmap bit 0 ~ 7*/
    u32 _reserved1;                /*0x018 - reserved*/
    u32 hss_if_reset;              /*0x01C - module hss IF reset */
    u32 dll_reset;                 /*0x020 - module dll reset */
    u32 config_mod;                /*0x024 - module configuration bitmap bit 0 - 7 */
    u32 ref_clk;                   /*0x028 - module reference clock */
    u32 _reserved2[5];             /*0x02C - 0x03C reserved*/
    u32 mod_gpio_data[6];          /*0x040 - 0x54 - module 1 - 7 gpiodata bitmap bit 0 ~ 7 [1=hi|0=low] */
    u32 _reserved3[2];             /*0x058 - 0x05C reserved*/
    u32 mod_gpio_dir[6];           /*0x060 - 0x074 module 1 - 6 gpio direction bitmap bit 0 ~ 7 [1=ouput|0=input] */
    u32 _reserved4[2];             /*0x078 - 0x07C reserved*/
                                   /*0x080 - 0x094 module io source selection per module slot
                                    *  Bit 0 - 16 
                                    *    0x00        = HSS configuration source
                                    *    0x01 - 0x0E = reserverd
                                    *    0x0F        = GPIO configuration source
                                   */ 
    u32 mod_src_sel[6];           /*0x080 - 0x94 module 1 - 6 source selection */
    
} MOD_CONFIG_REG;

#pragma pack(1)
typedef struct {
    u32 fpga_compile_time;
    u32 reserved[2];
    u32 fpga_rev;
    u32 reserved1[13];
    u8  fw_minor;
    u8  fw_major;
    u16 reserved2;
    u8  uboot_rev_sub;
    u8  uboot_rev_patch;
    u8  uboot_rev_lo;
    u8  uboot_rev_hi;
    u8  fsbl_rev_sub;
    u8  fsbl_rev_patch;
    u8  fsbl_rev_lo;
    u8  fsbl_rev_hi;
    char fw_build_str[24];
    char uboot_build_str[24];
    char fsbl_build_str[24];
} MOD_DATA;
#pragma pack()

/*global variable*/
MB_COMMON_MODULE *pCommonModule = (MB_COMMON_MODULE *) PS2FPGA_MB_COMMON_MODULE_STATUS_BASE_ADDR;
MB_RESET_CONFIG_REG *pMbResetReg = (MB_RESET_CONFIG_REG *) PS2FPGA_RESET_DURATION_OFFSET;
MOD_INFO_REG *pModInfo = (MOD_INFO_REG *) PS2FPGA_MOD_INFO_OFFSET;
MB_BUILTIN_MOD_ID_REG *pMbBuiltInModIdReg = (MB_BUILTIN_MOD_ID_REG *) PS2FPGA_MB_BUILTIN_MOD_BASE;
